Revit 2026 API

# RevitAPIEventArgs Properties

---

The RevitAPIEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

RevitAPIEventArgs Class

Autodesk.Revit.DB.Events Namespace